---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.Entity.#ctor(Autodesk.Revit.DB.ExtensibleStorage.Entity)
source: html/c4f2110a-4703-4782-1c82-c9cea6dd3569.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Entity.#ctor Method

Constructs a new copy of the input ESEntity object.

## Syntax (C#)
```csharp
public Entity(
	Entity other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.ExtensibleStorage.Entity`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null